Autodesk.Revit.DB.Mechanical.DuctSizes.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Mechanical.DuctSizes.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Mechanical.DuctSizes.GetDuctSizesIterator
Returns a DuctSizeIterator to the MEP duct sizes.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizes.Contains(System.Double)
Checks whether a duct size with the nominal diameter exists.
nominalDiameter:
Nominal diameter.
Returns:
True if a duct size with the nominal diameter exists.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizes.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSizes.Count
Count of the items contained in the collection.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizes.GetDuctSizeIterator
Returns a DuctSizeIterator that iterates through the collection.
Returns: A DuctSizeIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.Mechanical.DuctSizes
Class RbsDuctSizes being used to store the duct sizes
Since:
2013